In [24]:
'''please refer
w3school
real python 
geekforgeeks'''

'please refer\nw3school\nreal python \ngeekforgeeks'

# Cleaning data

Data Cleaning
Data cleaning means fixing bad data in your data set.

Bad data could be:

Empty cells
Data in wrong format
Wrong data
Duplicates
In this tutorial you will learn how to deal with all of them.

Our Data Set
In the next chapters we will use this data set:


      Duration          Date  Pulse  Maxpulse  Calories
  0         60  '2020/12/01'    110       130     409.1
  1         60  '2020/12/02'    117       145     479.0
  2         60  '2020/12/03'    103       135     340.0
  3         45  '2020/12/04'    109       175     282.4
  4         45  '2020/12/05'    117       148     406.0
  5         60  '2020/12/06'    102       127     300.0
  6         60  '2020/12/07'    110       136     374.0
  7        450  '2020/12/08'    104       134     253.3
  8         30  '2020/12/09'    109       133     195.1
  9         60  '2020/12/10'     98       124     269.0
  10        60  '2020/12/11'    103       147     329.3
  11        60  '2020/12/12'    100       120     250.7
  12        60  '2020/12/12'    100       120     250.7
  13        60  '2020/12/13'    106       128     345.3
  14        60  '2020/12/14'    104       132     379.3
  15        60  '2020/12/15'     98       123     275.0
  16        60  '2020/12/16'     98       120     215.2
  17        60  '2020/12/17'    100       120     300.0
  18        45  '2020/12/18'     90       112       NaN
  19        60  '2020/12/19'    103       123     323.0
  20        45  '2020/12/20'     97       125     243.0
  21        60  '2020/12/21'    108       131     364.2
  22        45           NaN    100       119     282.0
  23        60  '2020/12/23'    130       101     300.0
  24        45  '2020/12/24'    105       132     246.0
  25        60  '2020/12/25'    102       126     334.5
  26        60    2020/12/26    100       120     250.0
  27        60  '2020/12/27'     92       118     241.0
  28        60  '2020/12/28'    103       132       NaN
  29        60  '2020/12/29'    100       132     280.0
  30        60  '2020/12/30'    102       129     380.3
  31        60  '2020/12/31'     92       115     243.0

The data set contains some empty cells ("Date" in row 22, and "Calories" in row 18 and 28).

The data set contains wrong format ("Date" in row 26).

The data set contains wrong data ("Duration" in row 7).

The data set contains duplicates (row 11 and 12).

## Empty cells

#### Remove Rows
One way to deal with empty cells is to remove rows that contain empty cells.

This is usually OK, since data sets can be very big, and removing a few rows will not have a big impact on the result.

In [2]:
import pandas as pd
ufo = pd.read_table('http://bit.ly/uforeports',sep = ',')

ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18215 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

look there is many null values in the data.

In [4]:
new_ufo=ufo.dropna() # By default, the dropna() method returns a new DataFrame, and will not change the original.

In [5]:
new_ufo.head()

          City Colors Reported Shape Reported State             Time
12      Belton             RED         SPHERE    SC  6/30/1939 20:00
19  Bering Sea             RED          OTHER    AK  4/30/1943 23:00
36  Portsmouth             RED      FORMATION    VA   7/10/1945 1:30
44   Blairsden           GREEN         SPHERE    CA  6/30/1946 19:00
82    San Jose            BLUE        CHEVRON    CA  7/15/1947 21:00

In [7]:
new_ufo.info() # look now , the rows with raw values is removed

<class 'pandas.core.frame.DataFrame'>
Index: 2486 entries, 12 to 18239
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             2486 non-null   object
 1   Colors Reported  2486 non-null   object
 2   Shape Reported   2486 non-null   object
 3   State            2486 non-null   object
 4   Time             2486 non-null   object
dtypes: object(5)
memory usage: 116.5+ KB

But this is not the deal way to remove the or change the empty cells it works where the dataset is very big and there are only few
empty cells
but here you can see more than half rows are deleted

#### Replace empty values

In [10]:
replaced_ufo = ufo.fillna({'City':'city not reported'})
replaced_ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [19]:
ufo.loc[21] # before

City                          NaN
Colors Reported               NaN
Shape Reported                NaN
State                          LA
Time               8/15/1943 0:00
Name: 21, dtype: object

In [18]:
replaced_ufo.loc[21] #after

City               city not reported
Colors Reported                  NaN
Shape Reported                   NaN
State                             LA
Time                  8/15/1943 0:00
Name: 21, dtype: object

#### Replace Using Mean, Median, or Mode

A common way to replace empty cells, is to calculate the mean, median or mode value of the column.

Pandas uses the mean() median() and mode() methods to calculate the respective values for a specified column:

Example
Calculate the MEAN, and replace any empty values with it:

# this is just example
import pandas as pd

df = pd.read_csv('data.csv')

x = df["Calories"].mean()

df.fillna({"Calories": x}, inplace=True)

#### fillna()

In [ ]:
'''Example 2: Fill with Previous Value (Forward Fill)

The pad method is used to fill missing values with the previous value.
'''

df.fillna(method='pad')

In [ ]:
'''
Example 3: Fill with Next Value (Backward Fill)

The bfill function is used to fill it with the next value.
'''

df.fillna(method='bfill')

In [ ]:
'''Now we are going to fill all the null values in Gender column with "No Gender"
'''

d["Gender"].fillna('No Gender', inplace = True) 
d[10:25]

### Removing Duplicates

In [18]:
import pandas as pd
data = pd.DataFrame(

    {
        'Name':['Hasmukh','Arvind','Vijay','Shailesh','Shailesh','Arvind'],
        'Sirname':['Kheni','Lathiya','Kaklotar','Makwana','Makwana','Makwana'],
        'Age':['40','44','34','24','24','55']
        
    }
)

without_duplicates = data.drop_duplicates()
print(without_duplicates)

       Name   Sirname  Age
0   Hasmukh     Kheni   40
1    Arvind   Lathiya   39
2     Vijay  Kaklotar   39
3  Shailesh   Makwana   44
5    Arvind   Makwana   33

Parameters:

1. subset: Specifies the columns to check for duplicates. If not provided all columns are considered.

2. keep: Finds which duplicate to keep:

'first' (default): Keeps the first occurrence, removes subsequent duplicates.
'last': Keeps the last occurrence and removes previous duplicates.
False: Removes all occurrences of duplicates.
3. inplace: If True it modifies the original DataFrame directly. If False (default), returns a new DataFrame.

Return type: Method returns a new DataFrame with duplicates removed unless inplace=True.

Examples
Below are some examples of dataframe.drop_duplicates() method:`

### Pandas Change Datatype

#### Using astype() method

In [23]:
## now in the further example the age is given in string form lets convert it into float
data['Age'] = data['Age'].astype(float)
print(data.dtypes)

Name        object
Sirname     object
Age        float64
dtype: object

In [5]:
#please refer this for more information
'''https://www.geeksforgeeks.org/pandas/pandas-change-datatype/'''

'https://www.geeksforgeeks.org/pandas/pandas-change-datatype/'

Aggregation in Pandas
Aggregation means applying a mathematical function to summarize data. It can be used to get a summary of columns in our dataset like getting sum, minimum, maximum etc. from a particular column of our dataset. The function used for aggregation is agg() the parameter is the function we want to perform. Some functions used in the aggregation are:

Function	Description
sum()	Compute sum of column values
min()	Compute min of column values
max()	Compute max of column values
mean()	Compute mean of column
size()	Compute column sizes
describe()	Generates descriptive statistics
first()	Compute first of group values
last()	Compute last of group values
count()	Compute count of column values
std()	Standard deviation of column
var()	Compute variance of column
sem()	Standard error of the mean of colum